In [46]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [47]:
df= pd.read_csv("homeprices.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [48]:
df.bedrooms.median()

4.0

In [49]:
df.bedrooms.mean()

4.2

In [50]:
import math
median_bedrooms=math.floor(df.bedrooms.mean())
median_bedrooms

4

In [51]:
df.bedrooms=df.bedrooms.fillna(median_bedrooms)

In [52]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000